Revit 2027 API
BuiltInFailures.WallFailures.FaceIsNoLongerVertical Property
 Face defining this vertical Wall is no longer vertical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FaceIsNoLongerVertical { get; }
Public Shared ReadOnly Property FaceIsNoLongerVertical As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FaceIsNoLongerVertical {
	FailureDefinitionId^ get ();
}
static member FaceIsNoLongerVertical : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace